import pandas as ps # импортируем библиотеку pandas

DB = ps.DataFrame ({
    'ФИО' : ['Юрий Гагаринг Мишковский' , 'Григорий Весорионович Мешковский', 'Тиньков Юрий Николаевич'],
    'Адрес' : ['Ленинский проспект 10','Савеловская 8','Мажайский проспект 10'] , 
    'Телефон' : ['+8494904716', '+8458904716' , '+8490904716 '],
    'Дата рождения' : ['15.08.1998', '15.08.1988', '05.05.2005'], 
})#

print(DB)

ac = input( ' Здрсатвуйте, чтобы вы хотели изменить в справочной базе? (Добавить, Удалить, Изменить)')# спрашиваем что будут выбирать 
if ac == ('Добавить'):# если выбрали Добавить
        
        fio = input("Введите ФИО:") # пишем фио
        adress = input(" Адресс:")# пишем адресс
        number =  input(" Номер:")#пишем номер
        dateBirth = input(" Дата рождения")#пишем дату рожд
        addData = {"ФИО": fio, " Адресс:" : adress, " Номер:": number," Дата рождения": dateBirth }# добавляем фио, адресс, номер, дата рожд
        # DB.loc[len(DB)]= [fio,adress,number,dateBirth] чтобы заполнение пошло в последлнюю строку 
        new = ps.DataFrame([addData])#
        newData = ps.concat([new, DB], ignore_index= True)#
        print(newData)#

elif ac ==('Удалить'):# если выбрали Удалить
        delID = int(input("Введите номер(ID) элемента строки для удаления:"))# вводим номер ID для удаления
        DB.drop(delID, inplace=True)#
        print(DB)#
        
elif ac == ('Изменить'):#  если выбрали Изменить

        dataID = int(input("Введите номер (ID) элемента строки для изменения"))# вводим  элемент для изменения
        fio = input("Введите Фио:")#
        adress= input("Введите Адрес:")#
        number = input("Введите Номер:")#
        dateBirth = input("Введите Дата рождения:")#
        DB.loc[dataID]= [fio, adress, number,dateBirth ]#
        print(DB)#

else:
        print("Вы ввели не найденное действие...")# если ничего не выбрали или не то что надо
        
       
        
