import matplotlib.pyplot as pl # вызвал библиотеку matplotlib и назвал ее сокращенно "pl"
import numpy as np # вызвал библиотеку numpy и назвал ее сокращенно "np"
x = [-5,-4,-3,-2,-1,0,1,2,3,4,5,]

y = np.square(x) # задаем график функции для x**2

y1 = np.log(x) # задаем график функции для e**x

y2 = np.exp(x)# задаем график функции дляln(x) 

y3 = np.power(x , 3)# задаем график функции для x3

pl.plot(x,y, color="green", marker="*") # отресовал граффик функции, обозначил его "маркер" и его цвет
pl.plot(x,y1, color="blue", marker="+") # отресовал граффик функции, обозначил его "маркер" и его цвет
pl.plot(x,y2, color="red", marker="o") # отресовал граффик функции, обозначил его "маркер" и его цвет
pl.plot(x,y3, color="yellow", marker="s") # отресовал граффик функции, обозначил его "маркер" и его цвет
pl.title("Таблциа графиков функций") # дал наименование 
pl.show() # показываем график