import numpy as np # Импортируем библиотеку numpy
N = int(input("Введите колличесвто строк:"))# Просим ввести количество строк
M = int(input("Введите колличесвто столбцов:"))#Просим ввести количесвто столбцов
matrix = np.random.randint(-10,10,size=(N,M))# задаем матрице рандомные значения от -10 до 10
print( "Матрица", matrix )# делаем вывод данной матрицы
matrixTr= np.transpose(matrix)# делаем транспозицую матрицы
print(  "Транспонзиция:", matrixTr )#выводим эту матрицу

if N==M:# мы можем искать определитель когда матрица квадратная следовательно одинаковое количсвто строк и столбцов, в других случая не получиться
 opredel1 = np.linalg.det(matrix)# находим 1 определитель матрицы(исходной)
 opredel2= np.linalg.det(matrixTr)# находим 2 определитель матрицы (транспоз)
 print("1-ый определитель",opredel1)# выводим первый определитель
 print("2-ой определитель",opredel2) #выводим 2 определитель
 if opredel1 == opredel2: # сравниваем определители 
  print(' Определители равны')# если определители равны выводим это 
 else:# 
  print('Определители не равны')# если не равны то выводим что не равны
else: #
 print('Матрица не квадратная следовательно определителя нет')  #это если матрица не вкадратная